android_app/Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://127.0.0.1:8170"
  phases:
    - duration: 15
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up to 50 users"
    - duration: 30
      arrivalRate: 100
      name: "Sustained baseline: 100 concurrent users"
    - duration: 15
      arrivalRate: 10
      name: "Cool down"
  defaults:
    headers:
      User-Agent: "Artillery-DevSecOps-Engine/2.0"
scenarios:
  - name: "Farmer Platform Navigation"
    flow:
      - get:
          url: "/index.html"
      - think: 1
      - get:
          url: "/main_hub.html"
      - think: 1
      - get:
          url: "/dashboard.html"
      - think: 1
      - get:
          url: "/climate_risk.html"
      - think: 1
      - get:
          url: "/market.html"
